Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/rtstream/hardware/isp/hardware/include/regs/rts3915/isp_reg_ygc.h
#ifndef _ISP_REG_YGC_H_INC_
#define _ISP_REG_YGC_H_INC_

#include <isp_reg.h>
#include <isp_reg_base.h>

#define YGC_REG_LOAD (YGC_REG_BASE + 0x0004)
#define YGC_CURVE0 (YGC_REG_BASE + 0x0008)
#define YGC_CURVE1 (YGC_REG_BASE + 0x000C)
#define YGC_CURVE2 (YGC_REG_BASE + 0x0010)
#define YGC_CURVE3 (YGC_REG_BASE + 0x0014)
#define YGC_CURVE4 (YGC_REG_BASE + 0x0018)
#define YGC_CURVE5 (YGC_REG_BASE + 0x001C)
#define YGC_CURVE6 (YGC_REG_BASE + 0x0020)
#define YGC_CURVE7 (YGC_REG_BASE + 0x0024)
#define YGC_CURVE8 (YGC_REG_BASE + 0x0028)
#define YGC_CURVE9 (YGC_REG_BASE + 0x002C)
#define YGC_CURVE10 (YGC_REG_BASE + 0x0030)
#define YGC_CURVE11 (YGC_REG_BASE + 0x0034)
#define YGC_CURVE12 (YGC_REG_BASE + 0x0038)
#define YGC_CURVE13 (YGC_REG_BASE + 0x003C)
#define YGC_CURVE14 (YGC_REG_BASE + 0x0040)
#define YGC_CURVE15 (YGC_REG_BASE + 0x0044)
#define YGC_CURVE16 (YGC_REG_BASE + 0x0048)
#define YGC_CURVE17 (YGC_REG_BASE + 0x004C)
#define YGC_CURVE18 (YGC_REG_BASE + 0x0050)
#define YGC_CURVE19 (YGC_REG_BASE + 0x0054)
#define YGC_CURVE20 (YGC_REG_BASE + 0x0058)
#define YGC_CURVE21 (YGC_REG_BASE + 0x005C)
#define YGC_CURVE22 (YGC_REG_BASE + 0x0060)
#define YGC_CURVE23 (YGC_REG_BASE + 0x0064)
#define YGC_CURVE24 (YGC_REG_BASE + 0x0068)
#define YGC_CURVE25 (YGC_REG_BASE + 0x006C)
#define YGC_CURVE26 (YGC_REG_BASE + 0x0070)
#define YGC_CURVE27 (YGC_REG_BASE + 0x0074)
#define YGC_CURVE28 (YGC_REG_BASE + 0x0078)
#define YGC_CURVE29 (YGC_REG_BASE + 0x007C)
#define YGC_CURVE30 (YGC_REG_BASE + 0x0080)
#define YGC_CURVE31 (YGC_REG_BASE + 0x0084)

/* YGC_REG_LOAD 0x0004 */
#define YGC_REG_LOAD_OFFSET 0
#define YGC_REG_LOAD_BITS 1
#define YGC_REG_LOAD_MASK (((1 << 1) - 1) << 0)
/* YGC_CURVE0 0x0008 */
#define CONTRAST_CURVE_VALS0_OFFSET 0
#define CONTRAST_CURVE_VALS0_BITS 12
#define CONTRAST_CURVE_VALS0_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS1_OFFSET 16
#define CONTRAST_CURVE_VALS1_BITS 12
#define CONTRAST_CURVE_VALS1_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE1 0x000C */
#define CONTRAST_CURVE_VALS2_OFFSET 0
#define CONTRAST_CURVE_VALS2_BITS 12
#define CONTRAST_CURVE_VALS2_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS3_OFFSET 16
#define CONTRAST_CURVE_VALS3_BITS 12
#define CONTRAST_CURVE_VALS3_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE2 0x0010 */
#define CONTRAST_CURVE_VALS4_OFFSET 0
#define CONTRAST_CURVE_VALS4_BITS 12
#define CONTRAST_CURVE_VALS4_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS5_OFFSET 16
#define CONTRAST_CURVE_VALS5_BITS 12
#define CONTRAST_CURVE_VALS5_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE3 0x0014 */
#define CONTRAST_CURVE_VALS6_OFFSET 0
#define CONTRAST_CURVE_VALS6_BITS 12
#define CONTRAST_CURVE_VALS6_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS7_OFFSET 16
#define CONTRAST_CURVE_VALS7_BITS 12
#define CONTRAST_CURVE_VALS7_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE4 0x0018 */
#define CONTRAST_CURVE_VALS8_OFFSET 0
#define CONTRAST_CURVE_VALS8_BITS 12
#define CONTRAST_CURVE_VALS8_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS9_OFFSET 16
#define CONTRAST_CURVE_VALS9_BITS 12
#define CONTRAST_CURVE_VALS9_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE5 0x001C */
#define CONTRAST_CURVE_VALS10_OFFSET 0
#define CONTRAST_CURVE_VALS10_BITS 12
#define CONTRAST_CURVE_VALS10_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS11_OFFSET 16
#define CONTRAST_CURVE_VALS11_BITS 12
#define CONTRAST_CURVE_VALS11_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE6 0x0020 */
#define CONTRAST_CURVE_VALS12_OFFSET 0
#define CONTRAST_CURVE_VALS12_BITS 12
#define CONTRAST_CURVE_VALS12_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS13_OFFSET 16
#define CONTRAST_CURVE_VALS13_BITS 12
#define CONTRAST_CURVE_VALS13_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE7 0x0024 */
#define CONTRAST_CURVE_VALS14_OFFSET 0
#define CONTRAST_CURVE_VALS14_BITS 12
#define CONTRAST_CURVE_VALS14_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS15_OFFSET 16
#define CONTRAST_CURVE_VALS15_BITS 12
#define CONTRAST_CURVE_VALS15_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE8 0x0028 */
#define CONTRAST_CURVE_VALS16_OFFSET 0
#define CONTRAST_CURVE_VALS16_BITS 12
#define CONTRAST_CURVE_VALS16_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS17_OFFSET 16
#define CONTRAST_CURVE_VALS17_BITS 12
#define CONTRAST_CURVE_VALS17_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE9 0x002C */
#define CONTRAST_CURVE_VALS18_OFFSET 0
#define CONTRAST_CURVE_VALS18_BITS 12
#define CONTRAST_CURVE_VALS18_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS19_OFFSET 16
#define CONTRAST_CURVE_VALS19_BITS 12
#define CONTRAST_CURVE_VALS19_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE10 0x0030 */
#define CONTRAST_CURVE_VALS20_OFFSET 0
#define CONTRAST_CURVE_VALS20_BITS 12
#define CONTRAST_CURVE_VALS20_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS21_OFFSET 16
#define CONTRAST_CURVE_VALS21_BITS 12
#define CONTRAST_CURVE_VALS21_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE11 0x0034 */
#define CONTRAST_CURVE_VALS22_OFFSET 0
#define CONTRAST_CURVE_VALS22_BITS 12
#define CONTRAST_CURVE_VALS22_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS23_OFFSET 16
#define CONTRAST_CURVE_VALS23_BITS 12
#define CONTRAST_CURVE_VALS23_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE12 0x0038 */
#define CONTRAST_CURVE_VALS24_OFFSET 0
#define CONTRAST_CURVE_VALS24_BITS 12
#define CONTRAST_CURVE_VALS24_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS25_OFFSET 16
#define CONTRAST_CURVE_VALS25_BITS 12
#define CONTRAST_CURVE_VALS25_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE13 0x003C */
#define CONTRAST_CURVE_VALS26_OFFSET 0
#define CONTRAST_CURVE_VALS26_BITS 12
#define CONTRAST_CURVE_VALS26_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS27_OFFSET 16
#define CONTRAST_CURVE_VALS27_BITS 12
#define CONTRAST_CURVE_VALS27_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE14 0x0040 */
#define CONTRAST_CURVE_VALS28_OFFSET 0
#define CONTRAST_CURVE_VALS28_BITS 12
#define CONTRAST_CURVE_VALS28_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS29_OFFSET 16
#define CONTRAST_CURVE_VALS29_BITS 12
#define CONTRAST_CURVE_VALS29_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE15 0x0044 */
#define CONTRAST_CURVE_VALS30_OFFSET 0
#define CONTRAST_CURVE_VALS30_BITS 12
#define CONTRAST_CURVE_VALS30_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS31_OFFSET 16
#define CONTRAST_CURVE_VALS31_BITS 12
#define CONTRAST_CURVE_VALS31_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE16 0x0048 */
#define CONTRAST_CURVE_VALS32_OFFSET 0
#define CONTRAST_CURVE_VALS32_BITS 12
#define CONTRAST_CURVE_VALS32_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS33_OFFSET 16
#define CONTRAST_CURVE_VALS33_BITS 12
#define CONTRAST_CURVE_VALS33_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE17 0x004C */
#define CONTRAST_CURVE_VALS34_OFFSET 0
#define CONTRAST_CURVE_VALS34_BITS 12
#define CONTRAST_CURVE_VALS34_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS35_OFFSET 16
#define CONTRAST_CURVE_VALS35_BITS 12
#define CONTRAST_CURVE_VALS35_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE18 0x0050 */
#define CONTRAST_CURVE_VALS36_OFFSET 0
#define CONTRAST_CURVE_VALS36_BITS 12
#define CONTRAST_CURVE_VALS36_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS37_OFFSET 16
#define CONTRAST_CURVE_VALS37_BITS 12
#define CONTRAST_CURVE_VALS37_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE19 0x0054 */
#define CONTRAST_CURVE_VALS38_OFFSET 0
#define CONTRAST_CURVE_VALS38_BITS 12
#define CONTRAST_CURVE_VALS38_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS39_OFFSET 16
#define CONTRAST_CURVE_VALS39_BITS 12
#define CONTRAST_CURVE_VALS39_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE20 0x0058 */
#define CONTRAST_CURVE_VALS40_OFFSET 0
#define CONTRAST_CURVE_VALS40_BITS 12
#define CONTRAST_CURVE_VALS40_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS41_OFFSET 16
#define CONTRAST_CURVE_VALS41_BITS 12
#define CONTRAST_CURVE_VALS41_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE21 0x005C */
#define CONTRAST_CURVE_VALS42_OFFSET 0
#define CONTRAST_CURVE_VALS42_BITS 12
#define CONTRAST_CURVE_VALS42_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS43_OFFSET 16
#define CONTRAST_CURVE_VALS43_BITS 12
#define CONTRAST_CURVE_VALS43_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE22 0x0060 */
#define CONTRAST_CURVE_VALS44_OFFSET 0
#define CONTRAST_CURVE_VALS44_BITS 12
#define CONTRAST_CURVE_VALS44_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS45_OFFSET 16
#define CONTRAST_CURVE_VALS45_BITS 12
#define CONTRAST_CURVE_VALS45_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE23 0x0064 */
#define CONTRAST_CURVE_VALS46_OFFSET 0
#define CONTRAST_CURVE_VALS46_BITS 12
#define CONTRAST_CURVE_VALS46_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS47_OFFSET 16
#define CONTRAST_CURVE_VALS47_BITS 12
#define CONTRAST_CURVE_VALS47_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE24 0x0068 */
#define CONTRAST_CURVE_VALS48_OFFSET 0
#define CONTRAST_CURVE_VALS48_BITS 12
#define CONTRAST_CURVE_VALS48_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS49_OFFSET 16
#define CONTRAST_CURVE_VALS49_BITS 12
#define CONTRAST_CURVE_VALS49_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE25 0x006C */
#define CONTRAST_CURVE_VALS50_OFFSET 0
#define CONTRAST_CURVE_VALS50_BITS 12
#define CONTRAST_CURVE_VALS50_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS51_OFFSET 16
#define CONTRAST_CURVE_VALS51_BITS 12
#define CONTRAST_CURVE_VALS51_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE26 0x0070 */
#define CONTRAST_CURVE_VALS52_OFFSET 0
#define CONTRAST_CURVE_VALS52_BITS 12
#define CONTRAST_CURVE_VALS52_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS53_OFFSET 16
#define CONTRAST_CURVE_VALS53_BITS 12
#define CONTRAST_CURVE_VALS53_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE27 0x0074 */
#define CONTRAST_CURVE_VALS54_OFFSET 0
#define CONTRAST_CURVE_VALS54_BITS 12
#define CONTRAST_CURVE_VALS54_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS55_OFFSET 16
#define CONTRAST_CURVE_VALS55_BITS 12
#define CONTRAST_CURVE_VALS55_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE28 0x0078 */
#define CONTRAST_CURVE_VALS56_OFFSET 0
#define CONTRAST_CURVE_VALS56_BITS 12
#define CONTRAST_CURVE_VALS56_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS57_OFFSET 16
#define CONTRAST_CURVE_VALS57_BITS 12
#define CONTRAST_CURVE_VALS57_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE29 0x007C */
#define CONTRAST_CURVE_VALS58_OFFSET 0
#define CONTRAST_CURVE_VALS58_BITS 12
#define CONTRAST_CURVE_VALS58_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS59_OFFSET 16
#define CONTRAST_CURVE_VALS59_BITS 12
#define CONTRAST_CURVE_VALS59_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE30 0x0080 */
#define CONTRAST_CURVE_VALS60_OFFSET 0
#define CONTRAST_CURVE_VALS60_BITS 12
#define CONTRAST_CURVE_VALS60_MASK (((1 << 12) - 1) << 0)
#define CONTRAST_CURVE_VALS61_OFFSET 16
#define CONTRAST_CURVE_VALS61_BITS 12
#define CONTRAST_CURVE_VALS61_MASK (((1 << 12) - 1) << 16)
/* YGC_CURVE31 0x0084 */
#define CONTRAST_CURVE_VALS62_OFFSET 0
#define CONTRAST_CURVE_VALS62_BITS 12
#define CONTRAST_CURVE_VALS62_MASK (((1 << 12) - 1) << 0)

#endif /* _ISP_REG_YGC_H_INC_ */

